#+PROPERTY: header-args:jupyter-python :kernel verification-games :session /jpy:localhost#8888:forward-runs2 :async yes

#+begin_src elisp
(setq-local org-image-actual-width '(900))
(setq jupyter-repl-maximum-output 5000)
#+end_src

#+RESULTS:
: 5000


#+begin_src jupyter-python
%load_ext autoreload
%autoreload 2
#+end_src

#+RESULTS:



* Forward-model staging pipeline
:PROPERTIES:
:CUSTOM_ID: forward-model-staging-pipeline
:END:
This notebook stages the PARIS fluxes as a source-aware Zarr store,
registers that store in =games_catalog=, and runs resumable =fp_dot_flux=
site/month jobs.

#+begin_src jupyter-python
import logging
from pathlib import Path

from dask import compute as dask_compute
from dask.distributed import wait
import numpy as np
import pandas as pd
import xarray as xr

from verification_games.cluster import (
    load_slurm_account,
    make_slurm_cluster,
    wait_for_workers,
    warm_forward_model_numba,
)
from verification_games.flux_stage import (
    DEFAULT_CATALOG_PATH,
    build_staged_flux_dataset,
    find_flux_records,
    open_games_catalog,
    register_staged_flux_zarr,
    stage_flux_zarr,
    validate_staged_flux_zarr,
)
from verification_games.run_forward_model import (
    AVAILABLE_SHARED_STORE_SITES,
    compute_fp_dot_flux,
    get_month_footprint,
    iter_site_month_runs,
    open_staged_flux,
    run_site_month,
    run_site_month_safe,
)
#+end_src

#+RESULTS:

#+begin_src jupyter-python
for logger_name in ("openghg", "openghg.retrieve"):
    logger = logging.getLogger(logger_name)
    logger.setLevel(logging.CRITICAL)
    logger.propagate = False
    for handler in logger.handlers:
        handler.setLevel(logging.CRITICAL)

print("Suppressed OpenGHG log output below CRITICAL.")
#+end_src

#+RESULTS:
: Suppressed OpenGHG log output below CRITICAL.

#+begin_src jupyter-python
VG_PATH = Path("/group/chem/acrg/verification_games_round_2")
CATALOG_PATH = DEFAULT_CATALOG_PATH
WORK_ROOT = VG_PATH / "forward_model_intermediates"

STAGED_FLUX_ZARR = (
    VG_PATH
    / "games_catalog"
    / "data"
    / "flux"
    / "derived"
    / "PARIS_CTE-HR_filled_fluxes_staged"
    / "zarr_v2"
    / "paris_cte-hr_filled_fluxes_EUROPE_flux_stage_from_scenario_zarr_v2_filled_nan_zero_forward_model_input_202012-202112.zarr"
)
STAGED_FLUX_TEMP = WORK_ROOT / "staging_tmp"
FP_DOT_FLUX_OUTPUT_DIR = WORK_ROOT / "fp_dot_flux"
LOG_DIR = WORK_ROOT / "dask_logs"

SOURCE_FLUX_PROCESSING_STAGE = "scenario_zarr"
SOURCE_FLUX_VERSION = "v2"
SOURCE_FLUX_FORMAT = "zarr"

games_cat = open_games_catalog(CATALOG_PATH)
#+end_src

#+RESULTS:


** Cluster
:PROPERTIES:
:CUSTOM_ID: cluster
:END:
Start the cluster before staging so the Zarr write, unit conversion, and
NaN filling run on workers instead of the login process. The only reason
to delay cluster startup is to avoid spending queued walltime while editing
or inspecting cells.

#+begin_src jupyter-python
!cp /group/chem/acrg/verification_games_round_2/verification-games-fluxes/slurm.toml /user/home/bm13805/slurm.toml
#+end_src

#+RESULTS:

#+begin_src jupyter-python
START_CLUSTER = True

if START_CLUSTER:
    account = load_slurm_account("slurm.toml")
    cluster, client = make_slurm_cluster(
        log_path=LOG_DIR,
        account=account,
        walltime="12:00:00",
        n_workers=16,
        cores_per_worker=1,
        memory_per_worker_gb=48,
    )
    print(client)
#+end_src

#+RESULTS:
: <Client: 'tcp://172.25.9.102:35525' processes=0 threads=0, memory=0 B>

Restart cluster/client:
#+begin_src jupyter-python
if "staged_flux_for_run" in globals():
    client.cancel(staged_flux_for_run)
    del staged_flux_for_run

client.restart()
wait_for_workers(client, 16)
warm_status = warm_forward_model_numba(client)
print("Numba warm-up:", warm_status)
#+end_src

#+RESULTS:
:RESULTS:
# [goto error]
#+begin_example
---------------------------------------------------------------------------
KeyboardInterrupt                         Traceback (most recent call last)
Cell In[18], line 6
      2     client.cancel(staged_flux_for_run)
      3     del staged_flux_for_run
      4
      5 client.restart()
----> 6 wait_for_workers(client, 16)
      7 warm_status = warm_forward_model_numba(client)
      8 print("Numba warm-up:", warm_status)

File /group/chem/acrg/verification_games_round_2/verification-games/src/verification_games/cluster.py:88, in wait_for_workers(client, n_workers, timeout_s)
     86 def wait_for_workers(client, n_workers: int, timeout_s: int = 600) -> None:
     87     """Block until at least ``n_workers`` Dask workers have connected."""
---> 88     client.wait_for_workers(n_workers, timeout=timeout_s)

File /group/chem/acrg/verification_games_round_2/verification-games/.venv/lib/python3.12/site-packages/distributed/client.py:1674, in Client.wait_for_workers(self, n_workers, timeout)
   1669     raise ValueError(
   1670         f"`n_workers` must be a positive integer. Instead got {n_workers}."
   1671     )
   1673 if self.cluster and hasattr(self.cluster, "wait_for_workers"):
-> 1674     return self.cluster.wait_for_workers(n_workers, timeout)
   1676 return self.sync(self._wait_for_workers, n_workers, timeout=timeout)

File /group/chem/acrg/verification_games_round_2/verification-games/.venv/lib/python3.12/site-packages/distributed/deploy/cluster.py:636, in Cluster.wait_for_workers(self, n_workers, timeout)
    632 if not isinstance(n_workers, int) or n_workers < 1:
    633     raise ValueError(
    634         f"`n_workers` must be a positive integer. Instead got {n_workers}."
    635     )
--> 636 return self.sync(self._wait_for_workers, n_workers, timeout=timeout)

File /group/chem/acrg/verification_games_round_2/verification-games/.venv/lib/python3.12/site-packages/distributed/utils.py:381, in SyncMethodMixin.sync(self, func, asynchronous, callback_timeout, *args, **kwargs)
    379     return future
    380 else:
--> 381     return sync(
    382         self.loop, func, *args, callback_timeout=callback_timeout, **kwargs
    383     )

File /group/chem/acrg/verification_games_round_2/verification-games/.venv/lib/python3.12/site-packages/distributed/utils.py:454, in sync(loop, func, callback_timeout, *args, **kwargs)
    452 else:
    453     while not e.is_set():
--> 454         wait(10)
    456 if error is not None:
    457     raise error

File /group/chem/acrg/verification_games_round_2/verification-games/.venv/lib/python3.12/site-packages/distributed/utils.py:443, in sync.<locals>.wait(timeout)
    441 def wait(timeout: float | None) -> bool:
    442     try:
--> 443         return e.wait(timeout)
    444     except KeyboardInterrupt:
    445         loop.add_callback(cancel)

File ~/.local/share/uv/python/cpython-3.12.11-linux-x86_64-gnu/lib/python3.12/threading.py:655, in Event.wait(self, timeout)
    653 signaled = self._flag
    654 if not signaled:
--> 655     signaled = self._cond.wait(timeout)
    656 return signaled

File ~/.local/share/uv/python/cpython-3.12.11-linux-x86_64-gnu/lib/python3.12/threading.py:359, in Condition.wait(self, timeout)
    357 else:
    358     if timeout > 0:
--> 359         gotit = waiter.acquire(True, timeout)
    360     else:
    361         gotit = waiter.acquire(False)

KeyboardInterrupt:
#+end_example
:END:

For new clusters:
#+begin_src jupyter-python
wait_for_workers(client, 16)
warm_status = warm_forward_model_numba(client)
print("Numba warm-up:", warm_status)
#+end_src

#+RESULTS:
: Numba warm-up: {'tcp://10.133.1.54:42061': 'ok', 'tcp://10.133.1.56:33281': 'ok', 'tcp://10.133.1.56:42089': 'ok', 'tcp://10.133.1.65:40607': 'ok', 'tcp://10.133.1.65:43729': 'ok', 'tcp://10.133.1.66:42785': 'ok', 'tcp://10.133.1.66:45067': 'ok', 'tcp://10.133.1.85:38913': 'ok'}

#+begin_src jupyter-python
cluster.close()
client.close()
#+end_src

#+RESULTS:

*** Dashboard

#+name: dashboard_port
#+begin_src jupyter-python
from urllib.parse import urlparse

parsed = urlparse(str(client.dashboard_link))
parsed.port
#+end_src

#+RESULTS: dashboard_port
: 37463

#+name: local_dashboard_port
#+begin_src emacs-lisp
8787
#+end_src

#+RESULTS: local_dashboard_port
: 8787

#+name: dashboard_title
#+begin_src emacs-lisp :results value
(let ((session
       (save-excursion
         (goto-char (point-min))
         (when (re-search-forward "^#\+PROPERTY:.*:session[ \t]+\([^ \t\n]+\)" nil t)
           (match-string 1)))))
  (if session
      (concat "Dask: " (car (last (split-string session ":"))))
    "Dask dashboard"))
    #+end_src

    #+RESULTS: dashboard_title
    : Dask dashboard

#+begin_src bash :var remote_port=dashboard_port local_port=local_dashboard_port :results silent
pfwd -r "$remote_port" -l "$local_port" -y
#+end_src

#+begin_src bash :var local_port=local_dashboard_port title=dashboard_title :results silent
url="http://localhost:${local_port}/status"

wrapper="/tmp/dask-dashboard-${local_port}.html"

cat > "$wrapper" <<EOF
<!doctype html>
<html>
<head>
  <meta charset="utf-8">
  <title>${title}</title>
  <style>
    html, body {
      margin: 0;
      padding: 0;
      width: 100%;
      height: 100%;
      overflow: hidden;
    }
    iframe {
      border: 0;
      width: 100vw;
      height: 100vh;
    }
  </style>
</head>
<body>
  <iframe src="${url}"></iframe>
</body>
</html>
EOF

file_url="$(python3 -c 'from pathlib import Path; import sys; print(Path(sys.argv[1]).resolve().as_uri())' "$wrapper")"

osascript <<APPLESCRIPT
tell application "Safari"
    activate
    make new document with properties {URL:"$file_url"}
end tell
APPLESCRIPT
#+end_src

** Stage all fluxes
*** Checking inputs

#+begin_src jupyter-python
source_flux_query = {
    "record_type": "verification_games_flux",
    "university_abbr": "UOB",
    "processing_stage": SOURCE_FLUX_PROCESSING_STAGE,
    "version": SOURCE_FLUX_VERSION,
    "format": SOURCE_FLUX_FORMAT,
}
results = games_cat.search(where=source_flux_query, ignore_case=True, as_record_set=True)
print(
    results.to_dataframe(["id", "species", "games_scenario", "title"])
    .sort_values(["species", "games_scenario"])
)
#+end_src

#+RESULTS:
#+begin_example
     id species games_scenario                                        title
0   101     co2           ATEN  PARIS CO2 ATEN verification-games fluxes v2
1   102     co2           BASE  PARIS CO2 BASE verification-games fluxes v2
2   103     co2           DFIN  PARIS CO2 DFIN verification-games fluxes v2
3   104     co2           HFRA  PARIS CO2 HFRA verification-games fluxes v2
4   105     co2           HGER  PARIS CO2 HGER verification-games fluxes v2
5   106     co2           PTEN  PARIS CO2 PTEN verification-games fluxes v2
6   107      o2           ATEN   PARIS O2 ATEN verification-games fluxes v2
7   108      o2           BASE   PARIS O2 BASE verification-games fluxes v2
8   109      o2           DFIN   PARIS O2 DFIN verification-games fluxes v2
9   110      o2           HFRA   PARIS O2 HFRA verification-games fluxes v2
10  111      o2           HGER   PARIS O2 HGER verification-games fluxes v2
11  112      o2           PTEN   PARIS O2 PTEN verification-games fluxes v2
#+end_example

#+begin_src jupyter-python
from ogcat import CatalogRecordSet

from verification_games.flux_stage import find_flux_records


results2 = CatalogRecordSet(
    find_flux_records(
        games_cat,
        processing_stage=SOURCE_FLUX_PROCESSING_STAGE,
        version=SOURCE_FLUX_VERSION,
        data_format=SOURCE_FLUX_FORMAT,
    )
)
print(results2.to_dataframe(["id", "species", "games_scenario", "title"]))
#+end_src

#+RESULTS:
#+begin_example
     id species games_scenario                                        title
0   101     co2           ATEN  PARIS CO2 ATEN verification-games fluxes v2
1   102     co2           BASE  PARIS CO2 BASE verification-games fluxes v2
2   103     co2           DFIN  PARIS CO2 DFIN verification-games fluxes v2
3   104     co2           HFRA  PARIS CO2 HFRA verification-games fluxes v2
4   105     co2           HGER  PARIS CO2 HGER verification-games fluxes v2
5   106     co2           PTEN  PARIS CO2 PTEN verification-games fluxes v2
6   107      o2           ATEN   PARIS O2 ATEN verification-games fluxes v2
7   108      o2           BASE   PARIS O2 BASE verification-games fluxes v2
8   109      o2           DFIN   PARIS O2 DFIN verification-games fluxes v2
9   110      o2           HFRA   PARIS O2 HFRA verification-games fluxes v2
10  111      o2           HGER   PARIS O2 HGER verification-games fluxes v2
11  112      o2           PTEN   PARIS O2 PTEN verification-games fluxes v2
#+end_example

*** DONE Create combined flux as zarr
Set =RUN_STAGING = True= when ready. With =RUN_STAGING_DRY_RUN = True= this
opens the scenario-level Zarr inputs, builds the lazy stacked xarray object, and prints a summary
without writing Zarr or triggering Dask compute. With =RUN_STAGING_DRY_RUN =
False= it writes to a temporary Zarr directory, validates the staged
structure, then moves it into place.
The staged flux variable is explicitly written with Blosc/LZ4 compression
(clevel 5, shuffle) and =units = "mol m-2 s-1"=. Flux variables with
convertible units are converted before NaNs are filled.


#+begin_src jupyter-python
RUN_STAGING = False
RUN_STAGING_DRY_RUN = False

if RUN_STAGING:
    staged_path, input_records = stage_flux_zarr(
        games_cat,
        STAGED_FLUX_ZARR,
        temp_parent=STAGED_FLUX_TEMP,
        overwrite=False,
        processing_stage=SOURCE_FLUX_PROCESSING_STAGE,
        version=SOURCE_FLUX_VERSION,
        data_format=SOURCE_FLUX_FORMAT,
        dry_run=RUN_STAGING_DRY_RUN,
    )
else:
    staged_path = STAGED_FLUX_ZARR
    input_records = None

if RUN_STAGING and RUN_STAGING_DRY_RUN:
    summary = None
elif staged_path.exists():
    summary = validate_staged_flux_zarr(staged_path, full_nan_check=False)
else:
    print(f"Staged flux Zarr does not exist yet: {staged_path}")
    summary = None
print(summary)
#+end_src

#+RESULTS:
: {'path': '/group/chem/acrg/verification_games_round_2/games_catalog/data/flux/derived/PARIS_CTE-HR_filled_fluxes_staged/zarr_v2/paris_cte-hr_filled_fluxes_EUROPE_flux_stage_from_scenario_zarr_v2_filled_nan_zero_forward_model_input_202012-202112.zarr', 'sizes': {'time': 9048, 'lat': 293, 'lon': 391, 'source': 48}, 'chunks': {'time': (24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24), 'lat': (293,), 'lon': (391,), 'source': (4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4)}, 'sources': ['co2_ATEN_GPP', 'co2_ATEN_TER', 'co2_ATEN_FF', 'co2_ATEN_ocean', 'co2_BASE_GPP', 'co2_BASE_TER', 'co2_BASE_FF', 'co2_BASE_ocean', 'co2_DFIN_GPP', 'co2_DFIN_TER', 'co2_DFIN_FF', 'co2_DFIN_ocean', 'co2_HFRA_GPP', 'co2_HFRA_TER', 'co2_HFRA_FF', 'co2_HFRA_ocean', 'co2_HGER_GPP', 'co2_HGER_TER', 'co2_HGER_FF', 'co2_HGER_ocean', 'co2_PTEN_GPP', 'co2_PTEN_TER', 'co2_PTEN_FF', 'co2_PTEN_ocean', 'o2_ATEN_GPP', 'o2_ATEN_TER', 'o2_ATEN_FF', 'o2_ATEN_ocean', 'o2_BASE_GPP', 'o2_BASE_TER', 'o2_BASE_FF', 'o2_BASE_ocean', 'o2_DFIN_GPP', 'o2_DFIN_TER', 'o2_DFIN_FF', 'o2_DFIN_ocean', 'o2_HFRA_GPP', 'o2_HFRA_TER', 'o2_HFRA_FF', 'o2_HFRA_ocean', 'o2_HGER_GPP', 'o2_HGER_TER', 'o2_HGER_FF', 'o2_HGER_ocean', 'o2_PTEN_GPP', 'o2_PTEN_TER', 'o2_PTEN_FF', 'o2_PTEN_ocean']}

*** DONE Store in =ogcat=

#+begin_src jupyter-python
REGISTER_STAGED_ZARR = True

if REGISTER_STAGED_ZARR:
    if not staged_path.exists():
        raise FileNotFoundError(staged_path)
    if input_records is None:
        input_records = find_flux_records(
            games_cat,
            processing_stage=SOURCE_FLUX_PROCESSING_STAGE,
            version=SOURCE_FLUX_VERSION,
            data_format=SOURCE_FLUX_FORMAT,
        )
    staged_record = register_staged_flux_zarr(games_cat, staged_path, input_records)
    print(staged_record)
#+end_src

#+RESULTS:
: Registering staged flux Zarr reference in ogcat: /group/chem/acrg/verification_games_round_2/games_catalog/data/flux/derived/PARIS_CTE-HR_filled_fluxes_staged/zarr_v2/paris_cte-hr_filled_fluxes_EUROPE_flux_stage_from_scenario_zarr_v2_filled_nan_zero_forward_model_input_202012-202112.zarr
: CatalogRecord(catalog='games-catalog', time_added='2026-05-11T19:54:21Z', id='113', record_type='derived_flux', locator=ArtifactLocator(kind='path', value='/group/chem/acrg/verification_games_round_2/games_catalog/data/flux/derived/PARIS_CTE-HR_filled_fluxes_staged/zarr_v2/paris_cte-hr_filled_fluxes_EUROPE_flux_stage_from_scenario_zarr_v2_filled_nan_zero_forward_model_input_202012-202112.zarr', relative_path='data/flux/derived/PARIS_CTE-HR_filled_fluxes_staged/zarr_v2/paris_cte-hr_filled_fluxes_EUROPE_flux_stage_from_scenario_zarr_v2_filled_nan_zero_forward_model_input_202012-202112.zarr'), stored_abspath='/group/chem/acrg/verification_games_round_2/games_catalog/data/flux/derived/PARIS_CTE-HR_filled_fluxes_staged/zarr_v2/paris_cte-hr_filled_fluxes_EUROPE_flux_stage_from_scenario_zarr_v2_filled_nan_zero_forward_model_input_202012-202112.zarr', stored_relpath='data/flux/derived/PARIS_CTE-HR_filled_fluxes_staged/zarr_v2/paris_cte-hr_filled_fluxes_EUROPE_flux_stage_from_scenario_zarr_v2_filled_nan_zero_forward_model_input_202012-202112.zarr', storage_mode='reference', original_path='/group/chem/acrg/verification_games_round_2/games_catalog/data/flux/derived/PARIS_CTE-HR_filled_fluxes_staged/zarr_v2/paris_cte-hr_filled_fluxes_EUROPE_flux_stage_from_scenario_zarr_v2_filled_nan_zero_forward_model_input_202012-202112.zarr', original_filename='paris_cte-hr_filled_fluxes_EUROPE_flux_stage_from_scenario_zarr_v2_filled_nan_zero_forward_model_input_202012-202112.zarr', suffixes=['.zarr'], user_metadata={'title': 'PARIS verification-games staged flux Zarr for forward modelling.', 'product': 'PARIS_CTE-HR_filled_fluxes_staged', 'version': 'zarr_v1', 'species': ['co2', 'o2'], 'sector': ['GPP', 'TER', 'FF', 'ocean'], 'domain': 'EUROPE', 'provenance': 'derived', 'format': 'zarr', 'data_format': 'zarr', 'year': '202012-202112', 'keywords': ['flux_stage', 'filled_nan_zero', 'forward_model_input'], 'inputs': ['101', '102', '103', '104', '105', '106', '107', '108', '109', '110', '111', '112'], 'university_abbr': 'UOB', 'modifications': 'Stacked species/scenario/sector fluxes into a source dimension and filled flux NaNs with zero.'}, derived_metadata={'reader_hint': 'xarray.open_zarr', 'output_variables': ['flux'], 'sizes': {'time': 9048, 'lat': 293, 'lon': 391, 'source': 48}, 'chunks': {'time': 24, 'lat': 293, 'lon': 391, 'source': 4}, 'source_count': 48, 'sources': ['co2_ATEN_GPP', 'co2_ATEN_TER', 'co2_ATEN_FF', 'co2_ATEN_ocean', 'co2_BASE_GPP', 'co2_BASE_TER', 'co2_BASE_FF', 'co2_BASE_ocean', 'co2_DFIN_GPP', 'co2_DFIN_TER', 'co2_DFIN_FF', 'co2_DFIN_ocean', 'co2_HFRA_GPP', 'co2_HFRA_TER', 'co2_HFRA_FF', 'co2_HFRA_ocean', 'co2_HGER_GPP', 'co2_HGER_TER', 'co2_HGER_FF', 'co2_HGER_ocean', 'co2_PTEN_GPP', 'co2_PTEN_TER', 'co2_PTEN_FF', 'co2_PTEN_ocean', 'o2_ATEN_GPP', 'o2_ATEN_TER', 'o2_ATEN_FF', 'o2_ATEN_ocean', 'o2_BASE_GPP', 'o2_BASE_TER', 'o2_BASE_FF', 'o2_BASE_ocean', 'o2_DFIN_GPP', 'o2_DFIN_TER', 'o2_DFIN_FF', 'o2_DFIN_ocean', 'o2_HFRA_GPP', 'o2_HFRA_TER', 'o2_HFRA_FF', 'o2_HFRA_ocean', 'o2_HGER_GPP', 'o2_HGER_TER', 'o2_HGER_FF', 'o2_HGER_ocean', 'o2_PTEN_GPP', 'o2_PTEN_TER', 'o2_PTEN_FF', 'o2_PTEN_ocean'], 'input_record_ids': ['101', '102', '103', '104', '105', '106', '107', '108', '109', '110', '111', '112'], 'source_paths': ['/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/v2/scenario_zarr/PARIS_ATEN_co2_fluxes_v2.zarr', '/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/v2/scenario_zarr/PARIS_BASE_co2_fluxes_v2.zarr', '/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/v2/scenario_zarr/PARIS_DFIN_co2_fluxes_v2.zarr', '/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/v2/scenario_zarr/PARIS_HFRA_co2_fluxes_v2.zarr', '/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/v2/scenario_zarr/PARIS_HGER_co2_fluxes_v2.zarr', '/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/v2/scenario_zarr/PARIS_PTEN_co2_fluxes_v2.zarr', '/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/v2/scenario_zarr/PARIS_ATEN_o2_fluxes_v2.zarr', '/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/v2/scenario_zarr/PARIS_BASE_o2_fluxes_v2.zarr', '/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/v2/scenario_zarr/PARIS_DFIN_o2_fluxes_v2.zarr', '/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/v2/scenario_zarr/PARIS_HFRA_o2_fluxes_v2.zarr', '/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/v2/scenario_zarr/PARIS_HGER_o2_fluxes_v2.zarr', '/group/chem/acrg/verification_games_round_2/games_catalog/data/verification_games_flux/UOB/v2/scenario_zarr/PARIS_PTEN_o2_fluxes_v2.zarr'], 'nan_policy': 'Flux NaNs filled with 0.0 during staging.', 'units': 'mol m-2 s-1', 'zarr_compressor': {'id': 'blosc', 'cname': 'lz4', 'clevel': 5, 'shuffle': 1, 'blocksize': 0}, 'modifications': 'Stacked PARIS species/scenario/sector fluxes into a single source dimension, converted flux variables to mol m-2 s-1 where necessary, filled flux NaNs with zero, and persisted as chunked Zarr for forward modelling.'}, naming_metadata={'target_kind': 'directory', 'storage_relative_path': 'data/flux/derived/PARIS_CTE-HR_filled_fluxes_staged/zarr_v2/paris_cte-hr_filled_fluxes_EUROPE_flux_stage_from_scenario_zarr_v2_filled_nan_zero_forward_model_input_202012-202112.zarr', 'resolved_directory': '/group/chem/acrg/verification_games_round_2/games_catalog/data/flux/derived/PARIS_CTE-HR_filled_fluxes_staged/zarr_v2', 'resolved_filename': 'paris_cte-hr_filled_fluxes_EUROPE_flux_stage_from_scenario_zarr_v2_filled_nan_zero_forward_model_input_202012-202112.zarr'})


** Optional full NaN check
:PROPERTIES:
:CUSTOM_ID: optional-full-nan-check
:END:
This scans the whole staged Zarr and is intentionally separate from the
structure validation.

#+begin_src jupyter-python
RUN_FULL_NAN_CHECK = False

if RUN_FULL_NAN_CHECK:
    if not staged_path.exists():
        raise FileNotFoundError(staged_path)
    validate_staged_flux_zarr(staged_path, full_nan_check=True)
#+end_src


** Alignment debug
:PROPERTIES:
:CUSTOM_ID: alignment-debug
:END:
This cell checks the coordinate alignment used by the smoke run without
building the heavy forward-model graph. The intended outcome is that
=lat= and =lon= have the same length and match within small floating-point
tolerance. If so, the production path can safely replace the flux spatial
coordinates with the footprint coordinates before compute.

#+begin_src jupyter-python
RUN_ALIGNMENT_DEBUG = False

if RUN_ALIGNMENT_DEBUG:
    from verification_games.run_forward_model import (
        SPATIAL_COORD_TOLERANCE,
        _flux_slice_for_footprint,
    )

    fp_debug = get_month_footprint(site="MHD", start_date="2021-01-01", end_date="2021-02-01")
    flux_debug = open_staged_flux(staged_path)
    flux_slice_debug = _flux_slice_for_footprint(flux_debug, fp_debug)

    def _step_summary(values):
        values = np.asarray(values)
        if values.size < 2:
            return {"step_min": np.nan, "step_median": np.nan, "step_max": np.nan}
        diffs = np.diff(values.astype("float64"))
        return {
            "step_min": float(np.nanmin(diffs)),
            "step_median": float(np.nanmedian(diffs)),
            "step_max": float(np.nanmax(diffs)),
        }

    def _coord_report(dim):
        flux_coord = flux_slice_debug[dim]
        fp_coord = fp_debug[dim]
        flux_values = np.asarray(flux_coord.values)
        fp_values = np.asarray(fp_coord.values)
        row = {
            "dim": dim,
            "flux_size": flux_values.size,
            "fp_size": fp_values.size,
            "flux_dtype": str(flux_values.dtype),
            "fp_dtype": str(fp_values.dtype),
            "flux_first": float(flux_values[0]),
            "fp_first": float(fp_values[0]),
            "flux_last": float(flux_values[-1]),
            "fp_last": float(fp_values[-1]),
            "identical": bool(flux_coord.identical(fp_coord)),
            "same_size": bool(flux_values.shape == fp_values.shape),
        }
        row.update({f"flux_{key}": value for key, value in _step_summary(flux_values).items()})
        row.update({f"fp_{key}": value for key, value in _step_summary(fp_values).items()})

        if flux_values.shape == fp_values.shape:
            diff = flux_values.astype("float64") - fp_values.astype("float64")
            abs_diff = np.abs(diff)
            imax = int(np.nanargmax(abs_diff))
            row.update(
                {
                    "max_abs_diff": float(abs_diff[imax]),
                    "mean_abs_diff": float(np.nanmean(abs_diff)),
                    "argmax": imax,
                    "flux_at_argmax": float(flux_values[imax]),
                    "fp_at_argmax": float(fp_values[imax]),
                    "allclose_1e-6": bool(np.allclose(flux_values, fp_values, rtol=0.0, atol=1e-6)),
                    "allclose_1e-5": bool(np.allclose(flux_values, fp_values, rtol=0.0, atol=1e-5)),
                    "allclose_1e-4": bool(np.allclose(flux_values, fp_values, rtol=0.0, atol=1e-4)),
                }
            )
        return row

    coord_report = pd.DataFrame([_coord_report("lat"), _coord_report("lon")])
    print(coord_report.to_string(index=False))

    for dim in ("lat", "lon"):
        flux_values = np.asarray(flux_slice_debug[dim].values)
        fp_values = np.asarray(fp_debug[dim].values)
        if flux_values.shape != fp_values.shape:
            print(f"{dim}: size mismatch; cannot override coordinates safely.")
            continue
        mismatch = np.flatnonzero(~np.isclose(flux_values, fp_values, rtol=0.0, atol=SPATIAL_COORD_TOLERANCE))
        if mismatch.size:
            print(f"{dim}: first mismatches beyond {SPATIAL_COORD_TOLERANCE:g}")
            preview = pd.DataFrame(
                {
                    "index": mismatch[:10],
                    "flux": flux_values[mismatch[:10]],
                    "footprint": fp_values[mismatch[:10]],
                    "diff": flux_values[mismatch[:10]].astype("float64") - fp_values[mismatch[:10]].astype("float64"),
                }
            )
            print(preview.to_string(index=False))
        else:
            print(f"{dim}: safe to assign footprint coordinate to flux at atol={SPATIAL_COORD_TOLERANCE:g}.")

    fp_time = pd.DatetimeIndex(fp_debug["fp_time_resolved"]["time"].values)
    flux_time = pd.DatetimeIndex(flux_debug["time"].values)
    flux_slice_time = pd.DatetimeIndex(flux_slice_debug["time"].values)
    h_back_hours = np.rint(fp_debug["fp_time_resolved"]["H_back"].values).astype("int64")
    max_lag = int(h_back_hours.max()) if h_back_hours.size else 0
    expected_flux_time = pd.date_range(fp_time[0] - pd.Timedelta(hours=max_lag), fp_time[-1], freq="h")
    missing_flux_times = expected_flux_time.difference(flux_time)

    time_report = {
        "fp_start": fp_time[0],
        "fp_end": fp_time[-1],
        "fp_count": len(fp_time),
        "flux_slice_start": flux_slice_time[0],
        "flux_slice_end": flux_slice_time[-1],
        "flux_slice_count": len(flux_slice_time),
        "max_h_back_hours": max_lag,
        "expected_flux_start": expected_flux_time[0],
        "expected_flux_end": expected_flux_time[-1],
        "expected_flux_count": len(expected_flux_time),
        "missing_expected_flux_times": len(missing_flux_times),
        "fp_hourly": bool((pd.Series(fp_time).diff().dropna() == pd.Timedelta(hours=1)).all()),
        "flux_hourly": bool((pd.Series(flux_time).diff().dropna() == pd.Timedelta(hours=1)).all()),
    }
    print(pd.Series(time_report).to_string())
    if len(missing_flux_times):
        print("First missing expected flux times:", list(missing_flux_times[:10]))
#+end_src

#+RESULTS:
#+begin_example
Fetching footprint: {'site': 'mhd', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-01-01', 'end_date': '2021-02-01'}
dim  flux_size  fp_size flux_dtype fp_dtype  flux_first   fp_first  flux_last   fp_last  identical  same_size  flux_step_min  flux_step_median  flux_step_max  fp_step_min  fp_step_median  fp_step_max  max_abs_diff  mean_abs_diff  argmax  flux_at_argmax  fp_at_argmax  allclose_1e-6  allclose_1e-5  allclose_1e-4
lat        293      293    float64  float32   10.729000  10.729000  79.056999 79.056999      False       True       0.233994          0.234001       0.234001     0.233994        0.234001     0.234001      0.000008   1.659979e-07     263       72.271004     72.270996          False           True           True
lon        391      391    float64  float32  -97.900002 -97.899994  39.380001 39.380001      False       True       0.351997          0.352000       0.352005     0.351997        0.352000     0.352005      0.000008   3.217355e-06       0      -97.900002    -97.899994          False           True           True
lat: safe to assign footprint coordinate to flux at atol=1e-05.
lon: safe to assign footprint coordinate to flux at atol=1e-05.
fp_start                       2021-01-02 00:00:00
fp_end                         2021-01-31 23:00:00
fp_count                                       720
flux_slice_start               2021-01-01 01:00:00
flux_slice_end                 2021-02-01 00:00:00
flux_slice_count                               744
max_h_back_hours                                23
expected_flux_start            2021-01-01 01:00:00
expected_flux_end              2021-01-31 23:00:00
expected_flux_count                            743
missing_expected_flux_times                      0
fp_hourly                                     True
flux_hourly                                   True
#+end_example


** Smoke run
:PROPERTIES:
:CUSTOM_ID: smoke-run
:END:
The smoke run uses all staged sources for MHD in January 2021 and writes
one =time x source= Zarr output.

#+begin_src jupyter-python
!ls -lha /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/mhd
#+end_src

#+RESULTS:

#+begin_src jupyter-python
CLEAN_STALE_SMOKE_TMP = False

if CLEAN_STALE_SMOKE_TMP:
    import shutil

    smoke_output_dir = FP_DOT_FLUX_OUTPUT_DIR / "mhd"
    for tmp_path in smoke_output_dir.glob(".mhd_202101_fp_dot_flux.zarr.*.tmp"):
        print(f"Removing stale smoke temp output: {tmp_path}")
        shutil.rmtree(tmp_path)
#+end_src

#+RESULTS:

#+begin_src jupyter-python
RUN_SMOKE = False

if RUN_SMOKE:
    smoke = run_site_month(
        site="MHD",
        start_date="2021-01-01",
        end_date="2021-02-01",
        flux_zarr_path=staged_path,
        output_dir=FP_DOT_FLUX_OUTPUT_DIR,
        time_chunk=24,
        source_chunk=4,
        fillna_zero=False,
    )
    smoke
#+end_src

#+RESULTS:





** Smoke comparison
:PROPERTIES:
:CUSTOM_ID: smoke-comparison
:END:
This compares the staged, already-filled Zarr with a direct lazy stack
of the scenario-level Zarr flux records where NaNs are filled by the
forward-model helper.

#+begin_src jupyter-python
RUN_SMOKE_COMPARISON = False

if RUN_SMOKE_COMPARISON:
    fp = get_month_footprint(site="MHD", start_date="2021-01-01", end_date="2021-02-01")

    staged_flux = open_staged_flux(staged_path)
    staged_expr = compute_fp_dot_flux(
        fp,
        staged_flux,
        time_chunk=24,
        source_chunk=4,
        fillna_zero=False,
    )

    raw_flux_ds, _ = build_staged_flux_dataset(
        games_cat,
        processing_stage=SOURCE_FLUX_PROCESSING_STAGE,
        version=SOURCE_FLUX_VERSION,
        data_format=SOURCE_FLUX_FORMAT,
        fill_value=None,
    )
    raw_expr = compute_fp_dot_flux(
        fp,
        raw_flux_ds["flux"],
        time_chunk=24,
        source_chunk=4,
        fillna_zero=True,
    )

    staged_result, raw_result = dask_compute(staged_expr, raw_expr)
    xr.testing.assert_allclose(staged_result, raw_result, rtol=1e-5, atol=1e-8)
    staged_result
#+end_src

#+RESULTS:

#+begin_src jupyter-python
if "staged_result" in globals():
    print(staged_result)
#+end_src

#+RESULTS:

** Production loop
:PROPERTIES:
:CUSTOM_ID: production-loop
:END:
This skips =PUY= because it is not currently available in the shared
footprint Zarr store. Existing outputs are skipped by default, so
interrupted runs can be continued by re-running this cell. Missing
footprints and other per-site/month failures are written as failed
manifests instead of stopping the whole production loop.

#+begin_src jupyter-python
import datetime

RUN_PRODUCTION = True
PRODUCTION_SOURCE_CHUNK = 8
PERSIST_STAGED_FLUX = False

if RUN_PRODUCTION:
    print("Started production run:", datetime.datetime.now())

    if "staged_flux_for_run" in globals():
        try:
            client.cancel(staged_flux_for_run)
        except Exception as exc:
            print(f"Could not cancel previous staged flux futures: {type(exc).__name__}: {exc}")
        del staged_flux_for_run

    staged_flux_for_run = None
    if PERSIST_STAGED_FLUX:
        staged_flux_for_run = open_staged_flux(staged_path)
        staged_flux_for_run = staged_flux_for_run.chunk(
            {
                "time": 24,
                "source": PRODUCTION_SOURCE_CHUNK,
                "lat": 293,
                "lon": 391,
            }
        )
        staged_flux_for_run = client.persist(staged_flux_for_run)
        wait(staged_flux_for_run)

    completed = []
    for site, start_date, end_date in iter_site_month_runs(sites=AVAILABLE_SHARED_STORE_SITES):
        print(datetime.datetime.now())
        run = run_site_month_safe(
            site=site,
            start_date=start_date,
            end_date=end_date,
            flux_zarr_path=staged_path,
            output_dir=FP_DOT_FLUX_OUTPUT_DIR,
            staged_flux=staged_flux_for_run,
            time_chunk=24,
            source_chunk=PRODUCTION_SOURCE_CHUNK,
            fillna_zero=False,
            skip_existing=True,
        )
        completed.append(run)

    prod_df = pd.DataFrame([run.__dict__ for run in completed])
    print(prod_df["status"].value_counts(dropna=False))
    failed_df = prod_df.loc[prod_df["status"] == "failed"]
    if not failed_df.empty:
        print(
            failed_df[
                ["site", "start_date", "end_date", "error_type", "error_message", "output_path"]
            ].to_string(index=False)
        )

    print("Production run ended:", datetime.datetime.now())
#+end_src

#+RESULTS:
#+begin_example
Started production run: 2026-05-12 09:37:42.205264
2026-05-12 09:37:42.207482
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/bir/bir_202101_fp_dot_flux.zarr
2026-05-12 09:37:42.207712
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/bir/bir_202102_fp_dot_flux.zarr
2026-05-12 09:37:42.207806
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/bir/bir_202103_fp_dot_flux.zarr
2026-05-12 09:37:42.208327
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/bir/bir_202104_fp_dot_flux.zarr
2026-05-12 09:37:42.208447
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/bir/bir_202105_fp_dot_flux.zarr
2026-05-12 09:37:42.208694
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/bir/bir_202106_fp_dot_flux.zarr
2026-05-12 09:37:42.208949
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/bir/bir_202107_fp_dot_flux.zarr
2026-05-12 09:37:42.209036
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/bir/bir_202108_fp_dot_flux.zarr
2026-05-12 09:37:42.209114
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/bir/bir_202109_fp_dot_flux.zarr
2026-05-12 09:37:42.209261
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/bir/bir_202110_fp_dot_flux.zarr
2026-05-12 09:37:42.209333
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/bir/bir_202111_fp_dot_flux.zarr
2026-05-12 09:37:42.209420
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/bir/bir_202112_fp_dot_flux.zarr
2026-05-12 09:37:42.210041
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/bsd/bsd_202101_fp_dot_flux.zarr
2026-05-12 09:37:42.210164
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/bsd/bsd_202102_fp_dot_flux.zarr
2026-05-12 09:37:42.210248
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/bsd/bsd_202103_fp_dot_flux.zarr
2026-05-12 09:37:42.210327
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/bsd/bsd_202104_fp_dot_flux.zarr
2026-05-12 09:37:42.210410
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/bsd/bsd_202105_fp_dot_flux.zarr
2026-05-12 09:37:42.210482
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/bsd/bsd_202106_fp_dot_flux.zarr
2026-05-12 09:37:42.210555
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/bsd/bsd_202107_fp_dot_flux.zarr
2026-05-12 09:37:42.210622
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/bsd/bsd_202108_fp_dot_flux.zarr
2026-05-12 09:37:42.210692
Running fp_dot_flux for BSD 2021-09
Fetching footprint: {'site': 'bsd', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-09-01', 'end_date': '2021-10-01'}
Failed fp_dot_flux for BSD 2021-09: SearchError: Unable to find results for site='bsd', domain='europe', start_date='2021-09-01', end_date='2021-10-01', species='co2', data_type='footprints', store='shared_store_zarr'
2026-05-12 09:37:42.274696
Running fp_dot_flux for BSD 2021-10
Fetching footprint: {'site': 'bsd', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-10-01', 'end_date': '2021-11-01'}
Failed fp_dot_flux for BSD 2021-10: SearchError: Unable to find results for site='bsd', domain='europe', start_date='2021-10-01', end_date='2021-11-01', species='co2', data_type='footprints', store='shared_store_zarr'
2026-05-12 09:37:42.321569
Running fp_dot_flux for BSD 2021-11
Fetching footprint: {'site': 'bsd', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-11-01', 'end_date': '2021-12-01'}
Failed fp_dot_flux for BSD 2021-11: SearchError: Unable to find results for site='bsd', domain='europe', start_date='2021-11-01', end_date='2021-12-01', species='co2', data_type='footprints', store='shared_store_zarr'
2026-05-12 09:37:42.371923
Running fp_dot_flux for BSD 2021-12
Fetching footprint: {'site': 'bsd', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-12-01', 'end_date': '2022-01-01'}
Failed fp_dot_flux for BSD 2021-12: SearchError: Unable to find results for site='bsd', domain='europe', start_date='2021-12-01', end_date='2022-01-01', species='co2', data_type='footprints', store='shared_store_zarr'
2026-05-12 09:37:42.425752
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cbw/cbw_202101_fp_dot_flux.zarr
2026-05-12 09:37:42.425998
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cbw/cbw_202102_fp_dot_flux.zarr
2026-05-12 09:37:42.426090
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cbw/cbw_202103_fp_dot_flux.zarr
2026-05-12 09:37:42.426167
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cbw/cbw_202104_fp_dot_flux.zarr
2026-05-12 09:37:42.426240
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cbw/cbw_202105_fp_dot_flux.zarr
2026-05-12 09:37:42.426308
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cbw/cbw_202106_fp_dot_flux.zarr
2026-05-12 09:37:42.426382
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cbw/cbw_202107_fp_dot_flux.zarr
2026-05-12 09:37:42.426447
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cbw/cbw_202108_fp_dot_flux.zarr
2026-05-12 09:37:42.426509
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cbw/cbw_202109_fp_dot_flux.zarr
2026-05-12 09:37:42.426574
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cbw/cbw_202110_fp_dot_flux.zarr
2026-05-12 09:37:42.426638
Skipping existing fp_dot_flux output: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cbw/cbw_202111_fp_dot_flux.zarr
2026-05-12 09:37:42.426712
Running fp_dot_flux for CBW 2021-12
Fetching footprint: {'site': 'cbw', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-12-01', 'end_date': '2022-01-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cbw/.cbw_202112_fp_dot_flux.zarr.c6cc429aa4784e139d19585c513ffa35.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cbw/cbw_202112_fp_dot_flux.zarr
2026-05-12 09:38:33.169264
Running fp_dot_flux for CMN 2021-01
Fetching footprint: {'site': 'cmn', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-01-01', 'end_date': '2021-02-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/.cmn_202101_fp_dot_flux.zarr.a80c126d852c40ebacf3a795e0c713f4.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/cmn_202101_fp_dot_flux.zarr
2026-05-12 09:39:21.582452
Running fp_dot_flux for CMN 2021-02
Fetching footprint: {'site': 'cmn', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-02-01', 'end_date': '2021-03-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/.cmn_202102_fp_dot_flux.zarr.83d0e2b2878048b8819b3b2a6110b8c7.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/cmn_202102_fp_dot_flux.zarr
2026-05-12 09:40:07.291871
Running fp_dot_flux for CMN 2021-03
Fetching footprint: {'site': 'cmn', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-03-01', 'end_date': '2021-04-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/.cmn_202103_fp_dot_flux.zarr.b92a0f756303411fb144c181349fe8eb.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/cmn_202103_fp_dot_flux.zarr
2026-05-12 09:41:01.292096
Running fp_dot_flux for CMN 2021-04
Fetching footprint: {'site': 'cmn', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-04-01', 'end_date': '2021-05-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/.cmn_202104_fp_dot_flux.zarr.d14e371050cc420e9308e2e8684ed48c.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/cmn_202104_fp_dot_flux.zarr
2026-05-12 09:41:50.575697
Running fp_dot_flux for CMN 2021-05
Fetching footprint: {'site': 'cmn', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-05-01', 'end_date': '2021-06-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/.cmn_202105_fp_dot_flux.zarr.0369b3939d014086af122f4bb6ba2a2d.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/cmn_202105_fp_dot_flux.zarr
2026-05-12 09:42:44.145492
Running fp_dot_flux for CMN 2021-06
Fetching footprint: {'site': 'cmn', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-06-01', 'end_date': '2021-07-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/.cmn_202106_fp_dot_flux.zarr.4a11efc6da7f48b0a264a5d9a1d6b5ce.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/cmn_202106_fp_dot_flux.zarr
2026-05-12 09:43:32.179341
Running fp_dot_flux for CMN 2021-07
Fetching footprint: {'site': 'cmn', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-07-01', 'end_date': '2021-08-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/.cmn_202107_fp_dot_flux.zarr.910bc7c5f8954d3194e046b7ae1b9efa.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/cmn_202107_fp_dot_flux.zarr
2026-05-12 09:44:24.728848
Running fp_dot_flux for CMN 2021-08
Fetching footprint: {'site': 'cmn', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-08-01', 'end_date': '2021-09-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/.cmn_202108_fp_dot_flux.zarr.0d70461682354418a32528851a89bf0f.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/cmn_202108_fp_dot_flux.zarr
2026-05-12 09:45:20.693244
Running fp_dot_flux for CMN 2021-09
Fetching footprint: {'site': 'cmn', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-09-01', 'end_date': '2021-10-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/.cmn_202109_fp_dot_flux.zarr.4ab663c1fb3c49d394316c39763b5585.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/cmn_202109_fp_dot_flux.zarr
2026-05-12 09:46:09.571209
Running fp_dot_flux for CMN 2021-10
Fetching footprint: {'site': 'cmn', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-10-01', 'end_date': '2021-11-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/.cmn_202110_fp_dot_flux.zarr.0027677957854049b0ef7038fe9c8e4d.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/cmn_202110_fp_dot_flux.zarr
2026-05-12 09:47:02.300979
Running fp_dot_flux for CMN 2021-11
Fetching footprint: {'site': 'cmn', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-11-01', 'end_date': '2021-12-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/.cmn_202111_fp_dot_flux.zarr.398d38ac2dd24cd697d69ee87bddea10.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/cmn_202111_fp_dot_flux.zarr
2026-05-12 09:47:52.659440
Running fp_dot_flux for CMN 2021-12
Fetching footprint: {'site': 'cmn', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-12-01', 'end_date': '2022-01-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/.cmn_202112_fp_dot_flux.zarr.bce61577ab4b48a1abb7604991f3ffbd.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/cmn/cmn_202112_fp_dot_flux.zarr
2026-05-12 09:48:44.266883
Running fp_dot_flux for GAT 2021-01
Fetching footprint: {'site': 'gat', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-01-01', 'end_date': '2021-02-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/.gat_202101_fp_dot_flux.zarr.524875c106164cfbbf2de8f3bb9482a8.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/gat_202101_fp_dot_flux.zarr
2026-05-12 09:49:40.163939
Running fp_dot_flux for GAT 2021-02
Fetching footprint: {'site': 'gat', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-02-01', 'end_date': '2021-03-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/.gat_202102_fp_dot_flux.zarr.0f186b2ed984456bb8c8c8f7186cc9d3.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/gat_202102_fp_dot_flux.zarr
2026-05-12 09:50:23.689213
Running fp_dot_flux for GAT 2021-03
Fetching footprint: {'site': 'gat', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-03-01', 'end_date': '2021-04-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/.gat_202103_fp_dot_flux.zarr.0aa36c2766914d159c557b8bfde272d7.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/gat_202103_fp_dot_flux.zarr
2026-05-12 09:51:15.328585
Running fp_dot_flux for GAT 2021-04
Fetching footprint: {'site': 'gat', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-04-01', 'end_date': '2021-05-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/.gat_202104_fp_dot_flux.zarr.18073ba5f7f04c85bdc38e729664b56e.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/gat_202104_fp_dot_flux.zarr
2026-05-12 09:52:11.773358
Running fp_dot_flux for GAT 2021-05
Fetching footprint: {'site': 'gat', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-05-01', 'end_date': '2021-06-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/.gat_202105_fp_dot_flux.zarr.2c02db7dfb1047419ff5676da1bb7345.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/gat_202105_fp_dot_flux.zarr
2026-05-12 09:53:02.143586
Running fp_dot_flux for GAT 2021-06
Fetching footprint: {'site': 'gat', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-06-01', 'end_date': '2021-07-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/.gat_202106_fp_dot_flux.zarr.4fab906424fc4af3abe7fb495dc12240.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/gat_202106_fp_dot_flux.zarr
2026-05-12 09:53:52.653548
Running fp_dot_flux for GAT 2021-07
Fetching footprint: {'site': 'gat', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-07-01', 'end_date': '2021-08-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/.gat_202107_fp_dot_flux.zarr.93598033e79145a3bda1768b914e884e.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/gat_202107_fp_dot_flux.zarr
2026-05-12 09:54:42.164310
Running fp_dot_flux for GAT 2021-08
Fetching footprint: {'site': 'gat', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-08-01', 'end_date': '2021-09-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/.gat_202108_fp_dot_flux.zarr.d2021acfb6d34c88905dd9ee54f002a1.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/gat_202108_fp_dot_flux.zarr
2026-05-12 09:55:35.251526
Running fp_dot_flux for GAT 2021-09
Fetching footprint: {'site': 'gat', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-09-01', 'end_date': '2021-10-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/.gat_202109_fp_dot_flux.zarr.e9ea01f54743411297224b06cefc28a9.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/gat_202109_fp_dot_flux.zarr
2026-05-12 09:56:25.509069
Running fp_dot_flux for GAT 2021-10
Fetching footprint: {'site': 'gat', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-10-01', 'end_date': '2021-11-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/.gat_202110_fp_dot_flux.zarr.172d2ef6c75f410a863f5a1411138804.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/gat_202110_fp_dot_flux.zarr
2026-05-12 09:57:15.067034
Running fp_dot_flux for GAT 2021-11
Fetching footprint: {'site': 'gat', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-11-01', 'end_date': '2021-12-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/.gat_202111_fp_dot_flux.zarr.cde9baa67db64e2fb9ee769f2a6b9954.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/gat_202111_fp_dot_flux.zarr
2026-05-12 09:58:07.996823
Running fp_dot_flux for GAT 2021-12
Fetching footprint: {'site': 'gat', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-12-01', 'end_date': '2022-01-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/.gat_202112_fp_dot_flux.zarr.c5a8e2a300fe45179b05e5715ab2c242.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/gat/gat_202112_fp_dot_flux.zarr
2026-05-12 09:58:59.175332
Running fp_dot_flux for HEI 2021-01
Fetching footprint: {'site': 'hei', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-01-01', 'end_date': '2021-02-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/hei/.hei_202101_fp_dot_flux.zarr.286316932e1c4f6e97e90c0b18c4f47f.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/hei/hei_202101_fp_dot_flux.zarr
2026-05-12 09:59:49.941171
Running fp_dot_flux for HEI 2021-02
Fetching footprint: {'site': 'hei', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-02-01', 'end_date': '2021-03-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/hei/.hei_202102_fp_dot_flux.zarr.1419f69e17de4590b77d35b2e18d42a3.tmp
Moving fp_dot_flux Zarr into place: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/hei/hei_202102_fp_dot_flux.zarr
2026-05-12 10:00:38.829926
Running fp_dot_flux for HEI 2021-03
Fetching footprint: {'site': 'hei', 'domain': 'europe', 'store': 'shared_store_zarr', 'species': 'co2', 'start_date': '2021-03-01', 'end_date': '2021-04-01'}
Writing fp_dot_flux temporary Zarr: /group/chem/acrg/verification_games_round_2/forward_model_intermediates/fp_dot_flux/hei/.hei_202103_fp_dot_flux.zarr.998929574ea0465990af7e7f2ef3c3ab.tmp
#+end_example
